# Bold Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TableCellStyleOverrideOptions..::..Bold Property
TableCellStyleOverrideOptions Class See Also
---
Indicates if the bold characteristic is overridden.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public bool Bold { get; set; }
```

Visual Basic
---
```text
Public Property Bold As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool Bold {
	bool get ();
	void set (bool value);
}
```

# See Also
TableCellStyleOverrideOptions Class
Autodesk.Revit.DB Namespace